# 백트래킹 절대 안될듯..?
# 완전탐색. 시간 충분.. !

teto_dict = {
    # 짝대기
    0: ((0, 1), (0, 2), (0, 3)),
    1: ((1, 0), (2, 0), (3, 0)),

    # 네모
    2: ((0, 1), (1, 1), (1, 0)),

    # ㄱ자
    3: ((1, 0), (2, 0), (2, 1)),
    4: ((1, 0), (2, 0), (2, -1)),
    5: ((0, 1), (0, 2), (1, 2)),
    6: ((0, 1), (0, 2), (-1, 2)),
    7: ((0, 1), (1, 1), (2, 1)),
    8: ((0, 1), (1, 0), (2, 0)),
    9: ((-1, 0), (-1, 1), (-1, 2)),
    10: ((1, 0), (1, 1), (1, 2)),

    # --
    #  -- 모양
    11: ((1, 0), (1, 1), (2, 1)),
    12: ((1, 0), (1, -1), (2, -1)),
    13: ((0, 1), (-1, 1), (-1, 2)),
    14: ((0, 1), (1, 1), (1, 2)),

    # 엿 모양
    15: ((0, -1), (0, 1), (1, 0)),
    16: ((-1, 0), (0, 1), (1, 0)),
    17: ((-1, 0), (0, 1), (0, -1)),
    18: ((0, -1), (-1, 0), (1, 0))
}


def inb(y, x):
    return 0 <= y < n and 0 <= x < m


def find_max(k):
    """k번 도형을 통해 최대합 구하기"""
    global max_sum

    for y in range(n):
        for x in range(m):
            cy, cx = y, x
            now_sum = grid[cy][cx]

            for dy, dx in teto_dict[k]:
                ny, nx = cy + dy, cx + dx
                if inb(ny, nx):
                    now_sum += grid[ny][nx]
                else:
                    break
            else:
                max_sum = max(max_sum, now_sum)


##########################################################
n, m = map(int, input().split())
grid = [list(map(int, input().split())) for _ in range(n)]
##########################################################
max_sum = 0

for i in range(19):
    find_max(i)

print(max_sum)
